req.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:wsadis="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:d="http://schemas.xmlsoap.org/ws/2005/04/discovery" xmlns:i="http://printer.example.org/2003/imaging" xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:dn="http://www.onvif.org/ver10/network/wsdl" ><soap:Header><wsadis:Action>http://schemas.xmlsoap.org/ws/2005/04/discovery/ProbeMatches</wsadis:Action><wsadis:MessageID>uuid:283c0c28-4c5c-4318-8c7e-000000080160</wsadis:MessageID><wsadis:RelatesTo>uuid:9A245a4-cbc1-812-8bc1-5E0C0C0C0C0C</wsadis:RelatesTo><wsadis:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsadis:To><d:AppSequence InstanceId="1077004800" MessageNumber="2" /></soap:Header><soap:Body><d:ProbeMatches><d:ProbeMatch><wsadis:EndpointReference><wsadis:Address>uuid:283c0c28-4c5c-4318-8c7e-000000080160</wsadis:Address></wsadis:EndpointReference><d:Types>dn:NetworkVideoTransmitter</d:Types><d:Scopes> onvif://www.onvif.org/hardware/IPCamera/ onvif://www.onvif.org/location/china onvif://www.onvif.org/name/HD_1080P_68 onvif://www.onvif.org/type/avencoder/</d:Scopes><d:XAddrs>http:///onvif/device_service</d:XAddrs><d:MetadataVersion>75969</d:MetadataVersion></d:ProbeMatch></d:ProbeMatches></soap:Body></soap:Envelope>